Revit 2027 API
RebarStyle Enumeration
 Describes the usage style of a RebarShape. The style affects the bend radius and the set of allowable hooks. It also affects Rebar instance auto-constraining behavior.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarStyle
Public Enumeration RebarStyle
public enum class RebarStyle
type RebarStyle
Members
Member name | Value | Description
Standard | 0 |  A standard or longitudinal bar.
StirrupTie | 1 |  A stirrup or tie bar.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace